bfloc2alma.org
#+title: Alma API BIBFRAME
#+property: header-args:python :python /home/ss/.virtualenvs/bfloc2alma/bin/python3 :results verbatim :exports code
#+options: ^:nil
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.min.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.min.css" />
#+EXPORT_FILE_NAME: docs/index

* About this tutorial
This tutorial is about importing BIBFRAME from LoC into Alma. It's goal is to give you a starting point for writing your own scripts fitting your usecase. It assumes some familiarity with python or another scripting language.

You can follow along by pasting the code into your Python interpreter.

The source code can be found on GitHub: https://github.com/OBVSG/bfloc2alma/

There's a Video going through the material on Youtube: [[https://youtu.be/WYqgQV-oyoE]]

If you spot any errors, please report them to me: [[mailto:stefan.schuh@obvsg.at][stefan.schuh@obvsg.at]]

English is not my native language, so I gladly take grammar corrections and style suggestions, too. ;-)

* System requirements
This tutorial was developed and tested on Fedora Linux 41 with Python 3.13.1. There is nothing OS-specific here, so it should work without problems on Mac and Windows as well. As soon as I get access to a Windows machine, I will try it there.

On most Linux distributions Python comes preinstalled. You will have to install it on Windows. Get it here: https://www.python.org/

Note, that the invocations of the Python interpreter may vary a bit on your system. It's =python3= for me, but could also be just =python=, =python.exe= (on Windows) or similar.

** Virtual environment and third party libraries
I don't install any Python libraries outside of virtual environments, so I don't mess up my system. If you are not concerned about that, you can skip that and jump ahead to =pip install ...=

#+name: shell-venv
#+begin_src shell
$ python3 -m virtualenv .venv
$ source .venv/bin/activate
#+end_src

This creates an isolated environment and activates it. You can see this as there will be =(.venv)= prepended to your command line prompt.

Once you have done that, you have to install the only dependency:

#+name: shell-pip
#+begin_src shell
(.venv)$ pip install requests
#+end_src

If you are done you can deactivate the environment by typing =deactivate= on the prompt.
** API Key
To follow along, you need an API key with read/write permissions, preferably for a sandbox environment.

I assume that you have the API key in an environment variable. In bash like shells, you can accomplish this by

#+name: shell-api-key
#+begin_src shell :exports code
$ export API_KEY_PSB=paste-api-key-here
#+end_src

YMMV on Windows. You can put it in the =config.py= file, if you absolutely have no other choice. I strongly advise against doing so for security reasons.
* Library code
** Configuration

Our configuration will reside in it's own file, so our script isn't cluttered with constant definitions.

*** XML-Namespaces
XML-Namespaces that occur in BIBFRAME documents. This is to have prettier output (=bf= instead of =ns1= prefixes etc.) and also needed for XPath (=ET.find()= etc.).

#+name: namespaces
#+begin_src python :tangle no
NS = {
    "bf": "http://id.loc.gov/ontologies/bibframe/",
    "bflc": "http://id.loc.gov/ontologies/bflc/",
    "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
    "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
    "madsrdf": "http://www.loc.gov/mads/rdf/v1#",
    "dcterms": "http://purl.org/dc/terms/",
    "lclocal": "http://id.loc.gov/ontologies/lclocal/",
}

# register all namespaces for nicer output (no ns1, ns2, ... prefixes)
for prfx, uri in NS.items():
    ET.register_namespace(prfx, uri)
#+end_src
*** API-Key
You should never store any secrets in source files. You WILL eventually overlook it and publish it on GitHub. So we get it from an environment variable.

#+name: api-key
#+begin_src python :tangle no :session python
API_KEY = os.environ.get("API_KEY_PSB") or "put-your-key-here-if-you-absolutely-must"
#+end_src

