docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-19 Mo 07:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Alma API BIBFRAME</title>
<meta name="author" content="Stefan Schuh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="solarized-dark.min.css" />


</head>
<body>
<div id="content" class="content">
<h1 class="title">Alma API BIBFRAME</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org69213e5">1. About this tutorial</a></li>
<li><a href="#orgde0c496">2. System requirements</a>
<ul>
<li><a href="#org72d57eb">2.1. Virtual environment and third party libraries</a></li>
<li><a href="#org9581edd">2.2. API Key</a></li>
</ul>
</li>
<li><a href="#orgc1f348f">3. Library code</a>
<ul>
<li><a href="#org15a9cd7">3.1. Configuration</a>
<ul>
<li><a href="#org023176a">3.1.1. XML-Namespaces</a></li>
<li><a href="#orge256a02">3.1.2. API-Key</a></li>
<li><a href="#orgc66dddb">3.1.3. API URL</a></li>
<li><a href="#org6791a51">3.1.4. Session headers</a></li>
<li><a href="#org0c406a4">3.1.5. Put together config.py</a></li>
</ul>
</li>
<li><a href="#org670f224">3.2. Functions</a>
<ul>
<li><a href="#orgb309d29">3.2.1. Imports</a></li>
<li><a href="#orgd125b19">3.2.2. Getting data from LoC</a></li>
<li><a href="#org7583e97">3.2.3. Prepare BIBFRAME record for the Alma API</a></li>
<li><a href="#org96531c4">3.2.4. Helpers</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga81ff4b">4. Walkthrough with one Example</a>
<ul>
<li><a href="#orgb60202f">4.1. Getting the data from LoC</a></li>
<li><a href="#orgcc783ae">4.2. Creating BIBFRAME work and instance in Alma</a></li>
<li><a href="#org173cf50">4.3. Parsing the responses from Alma for further processing</a></li>
<li><a href="#orgf659c78">4.4. Update</a></li>
<li><a href="#orgac6abd1">4.5. Deleting the records again</a></li>
</ul>
</li>
<li><a href="#org816bad1">5. Simple CLI for importing multiple records</a>
<ul>
<li><a href="#org2fea2f2">5.1. Imports</a></li>
<li><a href="#org0bf1d97">5.2. Argument parsing</a></li>
<li><a href="#org09ed118">5.3. Getting data from LoC</a></li>
<li><a href="#org3ba71ae">5.4. Importing into Alma</a></li>
<li><a href="#orgc61ee83">5.5. Cleanup after test runs</a></li>
<li><a href="#org275f9d9">5.6. Example execution</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org69213e5" class="outline-2">
<h2 id="org69213e5"><span class="section-number-2">1.</span> About this tutorial</h2>
<div class="outline-text-2" id="text-1">
<p>
This tutorial is about importing BIBFRAME from LoC into Alma. It&rsquo;s goal is to give you a starting point for writing your own scripts fitting your usecase. It assumes some familiarity with python or another scripting language.
</p>

<p>
You can follow along by pasting the code into your Python interpreter.
</p>

<p>
The source code can be found on GitHub: <a href="https://github.com/OBVSG/bfloc2alma/">https://github.com/OBVSG/bfloc2alma/</a>
</p>

<p>
There&rsquo;s a Video going through the material on Youtube: <a href="https://youtu.be/WYqgQV-oyoE">https://youtu.be/WYqgQV-oyoE</a>
</p>

<p>
If you spot any errors, please report them to me: <a href="mailto:stefan.schuh@obvsg.at">stefan.schuh@obvsg.at</a>
</p>

<p>
English is not my native language, so I gladly take grammar corrections and style suggestions, too. ;-)
</p>
</div>
</div>
<div id="outline-container-orgde0c496" class="outline-2">
<h2 id="orgde0c496"><span class="section-number-2">2.</span> System requirements</h2>
<div class="outline-text-2" id="text-2">
<p>
This tutorial was developed and tested on Fedora Linux 41 with Python 3.13.1. There is nothing OS-specific here, so it should work without problems on Mac and Windows as well. As soon as I get access to a Windows machine, I will try it there.
</p>

<p>
On most Linux distributions Python comes preinstalled. You will have to install it on Windows. Get it here: <a href="https://www.python.org/">https://www.python.org/</a>
</p>

<p>
Note, that the invocations of the Python interpreter may vary a bit on your system. It&rsquo;s <code>python3</code> for me, but could also be just <code>python</code>, <code>python.exe</code> (on Windows) or similar.
</p>
</div>
<div id="outline-container-org72d57eb" class="outline-3">
<h3 id="org72d57eb"><span class="section-number-3">2.1.</span> Virtual environment and third party libraries</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I don&rsquo;t install any Python libraries outside of virtual environments, so I don&rsquo;t mess up my system. If you are not concerned about that, you can skip that and jump ahead to <code>pip install ...</code>
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgf30ade6">$ python3 -m virtualenv .venv
$ source .venv/bin/activate
</pre>
</div>

<p>
This creates an isolated environment and activates it. You can see this as there will be <code>(.venv)</code> prepended to your command line prompt.
</p>

<p>
Once you have done that, you have to install the only dependency:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org9e003aa"><span style="color: #268bd2;">(</span>.venv<span style="color: #268bd2;">)</span>$ pip install requests
</pre>
</div>

<p>
If you are done you can deactivate the environment by typing <code>deactivate</code> on the prompt.
</p>
</div>
</div>
<div id="outline-container-org9581edd" class="outline-3">
<h3 id="org9581edd"><span class="section-number-3">2.2.</span> API Key</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To follow along, you need an API key with read/write permissions, preferably for a sandbox environment.
</p>

<p>
I assume that you have the API key in an environment variable. In bash like shells, you can accomplish this by
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org299109b">$ export <span style="color: #6c71c4;">API_KEY_PSB</span>=paste-api-key-here
</pre>
</div>

<p>
YMMV on Windows. You can put it in the <code>config.py</code> file, if you absolutely have no other choice. I strongly advise against doing so for security reasons.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1f348f" class="outline-2">
<h2 id="orgc1f348f"><span class="section-number-2">3.</span> Library code</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org15a9cd7" class="outline-3">
<h3 id="org15a9cd7"><span class="section-number-3">3.1.</span> Configuration</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Our configuration will reside in it&rsquo;s own file, so our script isn&rsquo;t cluttered with constant definitions.
</p>
</div>
<div id="outline-container-org023176a" class="outline-4">
<h4 id="org023176a"><span class="section-number-4">3.1.1.</span> XML-Namespaces</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
XML-Namespaces that occur in BIBFRAME documents. This is to have prettier output (<code>bf</code> instead of <code>ns1</code> prefixes etc.) and also needed for XPath (<code>ET.find()</code> etc.).
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgbd8faa4"><span style="color: #6c71c4;">NS</span> = {
    <span style="color: #2aa198;">"bf"</span>: <span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe/"</span>,
    <span style="color: #2aa198;">"bflc"</span>: <span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span>,
    <span style="color: #2aa198;">"rdf"</span>: <span style="color: #2aa198;">"http://www.w3.org/1999/02/22-rdf-syntax-ns#"</span>,
    <span style="color: #2aa198;">"rdfs"</span>: <span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#"</span>,
    <span style="color: #2aa198;">"madsrdf"</span>: <span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span>,
    <span style="color: #2aa198;">"dcterms"</span>: <span style="color: #2aa198;">"http://purl.org/dc/terms/"</span>,
    <span style="color: #2aa198;">"lclocal"</span>: <span style="color: #2aa198;">"http://id.loc.gov/ontologies/lclocal/"</span>,
}

<span style="color: #405A61;"># </span><span style="color: #405A61;">register all namespaces for nicer output (no ns1, ns2, ... prefixes)</span>
<span style="color: #859900; font-weight: bold;">for</span> prfx, uri <span style="color: #859900; font-weight: bold;">in</span> NS.items():
    ET.register_namespace(prfx, uri)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge256a02" class="outline-4">
<h4 id="orge256a02"><span class="section-number-4">3.1.2.</span> API-Key</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
You should never store any secrets in source files. You WILL eventually overlook it and publish it on GitHub. So we get it from an environment variable.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org00db72c"><span style="color: #6c71c4;">API_KEY</span> = os.environ.get(<span style="color: #2aa198;">"API_KEY_PSB"</span>) <span style="color: #859900; font-weight: bold;">or</span> <span style="color: #2aa198;">"put-your-key-here-if-you-absolutely-must"</span>
</pre>
</div>
</div>
</div>
