bfloc2alma.org
*** Prepare BIBFRAME record for the Alma API
For a BIBFRAME record to be posted to Almas API it has to be wrapped in some XML. It's a bad idea to do this by string manipulation, so we use the =xml.etree.ElementTree=-API of Python.

#+name: prep-rec
#+begin_src python :session python :tangle bfloc2alma/lib.py
# prep BIBFRAME record for Alma
def prep_rec(bf_rec):
    """Wrap BIBFRAME to be posted to Almas API.

    <bib>
      <record_format>lcbf_work</record_format>
      <record>
        [BIBFRAME HERE ...]
      </record>
    </bib>
    """
    NS = {"bf": "http://id.loc.gov/ontologies/bibframe/"}
    # bf_rec needs to be an ET.Element to be handled further
    if type(bf_rec) == str:
        bf_rec = ET.fromstring(bf_rec)
    elif type(bf_rec) != ET.Element:
        raise Error("bf_rec must be str or ET.Element!")

    # check which entity we have
    if bf_rec.find('bf:Work', NS) is not None:
        entity = "work"
    elif bf_rec.find('bf:Instance', NS) is not None:
        entity = "instance"
    else:
        raise Exception("Input is neither a work nor an instance!")

    # create XML tree
    bib = ET.Element('bib')
    record_format = ET.Element('record_format')
    record_format.text = f"lcbf_{entity}"
    bib.append(record_format)
    record = ET.Element("record")
    record.append(bf_rec)
    bib.append(record)

    return ET.tostring(bib)
#+end_src
*** Helpers
A small function to get the MMS-ID from an API response:

#+name: get-mmsid
#+begin_src python :session python :tangle bfloc2alma/lib.py
def get_mmsid(response):
    """Get the MMS ID from an Alma API response."""
    response_tree = ET.fromstring(response.text)
    mms = response_tree.find('mms_id')
    return mms.text
#+end_src

* Walkthrough with one Example
Our Example is "Weapons of Math Destruction" by Cathy O'Neil. The ID is "19016283". You can obtain an identifier for your favorite book by searching for it at https://id.loc.gov/ and copying the Identifer from the "Identifier"-column of the search results.

Another one would be Mary Roach's "Stiff", "12983234".

