docs/index.html
<div id="outline-container-org7583e97" class="outline-4">
<h4 id="org7583e97"><span class="section-number-4">3.2.3.</span> Prepare BIBFRAME record for the Alma API</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
For a BIBFRAME record to be posted to Almas API it has to be wrapped in some XML. It&rsquo;s a bad idea to do this by string manipulation, so we use the <code>xml.etree.ElementTree</code>-API of Python.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org6420318"><span style="color: #405A61;"># </span><span style="color: #405A61;">prep BIBFRAME record for Alma</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">prep_rec</span>(bf_rec):
    <span style="color: #35a69c;">"""Wrap BIBFRAME to be posted to Almas API.</span>

<span style="color: #35a69c;">    &lt;bib&gt;</span>
<span style="color: #35a69c;">      &lt;record_format&gt;lcbf_work&lt;/record_format&gt;</span>
<span style="color: #35a69c;">      &lt;record&gt;</span>
<span style="color: #35a69c;">        [BIBFRAME HERE ...]</span>
<span style="color: #35a69c;">      &lt;/record&gt;</span>
<span style="color: #35a69c;">    &lt;/bib&gt;</span>
<span style="color: #35a69c;">    """</span>
    <span style="color: #6c71c4;">NS</span> = {<span style="color: #2aa198;">"bf"</span>: <span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe/"</span>}
    <span style="color: #405A61;"># </span><span style="color: #405A61;">bf_rec needs to be an ET.Element to be handled further</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">type</span>(bf_rec) == <span style="color: #268bd2;">str</span>:
        <span style="color: #6c71c4;">bf_rec</span> = ET.fromstring(bf_rec)
    <span style="color: #859900; font-weight: bold;">elif</span> <span style="color: #268bd2;">type</span>(bf_rec) != ET.Element:
        <span style="color: #859900; font-weight: bold;">raise</span> Error(<span style="color: #2aa198;">"bf_rec must be str or ET.Element!"</span>)

    <span style="color: #405A61;"># </span><span style="color: #405A61;">check which entity we have</span>
    <span style="color: #859900; font-weight: bold;">if</span> bf_rec.find(<span style="color: #2aa198;">'bf:Work'</span>, NS) <span style="color: #859900; font-weight: bold;">is</span> <span style="color: #859900; font-weight: bold;">not</span> <span style="color: #d33682; font-weight: bold;">None</span>:
        <span style="color: #6c71c4;">entity</span> = <span style="color: #2aa198;">"work"</span>
    <span style="color: #859900; font-weight: bold;">elif</span> bf_rec.find(<span style="color: #2aa198;">'bf:Instance'</span>, NS) <span style="color: #859900; font-weight: bold;">is</span> <span style="color: #859900; font-weight: bold;">not</span> <span style="color: #d33682; font-weight: bold;">None</span>:
        <span style="color: #6c71c4;">entity</span> = <span style="color: #2aa198;">"instance"</span>
    <span style="color: #859900; font-weight: bold;">else</span>:
        <span style="color: #859900; font-weight: bold;">raise</span> <span style="color: #b58900;">Exception</span>(<span style="color: #2aa198;">"Input is neither a work nor an instance!"</span>)

    <span style="color: #405A61;"># </span><span style="color: #405A61;">create XML tree</span>
    <span style="color: #6c71c4;">bib</span> = ET.Element(<span style="color: #2aa198;">'bib'</span>)
    <span style="color: #6c71c4;">record_format</span> = ET.Element(<span style="color: #2aa198;">'record_format'</span>)
    record_format.<span style="color: #6c71c4;">text</span> = f<span style="color: #2aa198;">"lcbf_</span>{entity}<span style="color: #2aa198;">"</span>
    bib.append(record_format)
    <span style="color: #6c71c4;">record</span> = ET.Element(<span style="color: #2aa198;">"record"</span>)
    record.append(bf_rec)
    bib.append(record)

    <span style="color: #859900; font-weight: bold;">return</span> ET.tostring(bib)
</pre>
</div>
</div>
</div>
<div id="outline-container-org96531c4" class="outline-4">
<h4 id="org96531c4"><span class="section-number-4">3.2.4.</span> Helpers</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
A small function to get the MMS-ID from an API response:
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgda3a8f9"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">get_mmsid</span>(response):
    <span style="color: #35a69c;">"""Get the MMS ID from an Alma API response."""</span>
    <span style="color: #6c71c4;">response_tree</span> = ET.fromstring(response.text)
    <span style="color: #6c71c4;">mms</span> = response_tree.find(<span style="color: #2aa198;">'mms_id'</span>)
    <span style="color: #859900; font-weight: bold;">return</span> mms.text
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orga81ff4b" class="outline-2">
<h2 id="orga81ff4b"><span class="section-number-2">4.</span> Walkthrough with one Example</h2>
<div class="outline-text-2" id="text-4">
<p>
Our Example is &ldquo;Weapons of Math Destruction&rdquo; by Cathy O&rsquo;Neil. The ID is &ldquo;19016283&rdquo;. You can obtain an identifier for your favorite book by searching for it at <a href="https://id.loc.gov/">https://id.loc.gov/</a> and copying the Identifer from the &ldquo;Identifier&rdquo;-column of the search results.
</p>

<p>
Another one would be Mary Roach&rsquo;s &ldquo;Stiff&rdquo;, &ldquo;12983234&rdquo;.
</p>
</div>
