docs/index.html
<div id="outline-container-orgb60202f" class="outline-3">
<h3 id="orgb60202f"><span class="section-number-3">4.1.</span> Getting the data from LoC</h3>
<div class="outline-text-3" id="text-4-1">
<p>
So, let&rsquo;s get our work and instance:
</p>
<div class="org-src-container">
<pre class="src src-python" id="org9fa6d2e"><span style="color: #6c71c4;">work_xml</span> = get_bibframe_from_loc(<span style="color: #2aa198;">"19016283"</span>, entity=<span style="color: #2aa198;">"work"</span>, compact=<span style="color: #d33682; font-weight: bold;">True</span>)
<span style="color: #6c71c4;">instance_xml</span> = get_bibframe_from_loc(<span style="color: #2aa198;">"19016283"</span>, entity=<span style="color: #2aa198;">"instance"</span>, compact=<span style="color: #d33682; font-weight: bold;">True</span>)
</pre>
</div>

<pre class="example">
None
</pre>


<p>
How does it look?
</p>
<div class="org-src-container">
<pre class="src src-python">work_xml
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xml" id="orgbac3f37"><span style="color: #839496; background-color: #002b36;">&lt;?</span><span style="color: #859900; font-weight: bold;">xml</span> <span style="color: #35a69c;">version="1.0" encoding="utf-8"</span><span style="color: #839496; background-color: #002b36;">?&gt;</span>
<span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">RDF</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">rdf</span>=<span style="color: #2aa198;">"http://www.w3.org/1999/02/22-rdf-syntax-ns#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Work</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/resources/works/19016283"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bf</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bflc</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">O'Neil, Cathy Weapons of math destruction</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bflc</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">o'neilcathyweaponsofmathdestruction</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe/Text"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe/Monograph"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">language</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/languages/eng"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">supplementaryContent</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/msupplcont/bibliography"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">supplementaryContent</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/msupplcont/index"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">geographicCoverage</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/geographicAreas/n-us"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classification</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">ClassificationLcc</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classificationPortion</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">QA76.9.B45</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classificationPortion</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">itemPortion</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">O64 2016</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">itemPortion</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">assigner</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/organizations/dlc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">status</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/mstatus/uba"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">ClassificationLcc</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classification</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classification</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">ClassificationDdc</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classificationPortion</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">005.7</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classificationPortion</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">source</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Source</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">code</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">23</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">code</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Source</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">source</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">edition</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">full</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">edition</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">assigner</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/organizations/dlc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">ClassificationDdc</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">classification</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">contribution</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Contribution</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe/PrimaryContribution"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">agent</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/rwo/agents/no2013123474"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">role</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/relators/aut"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Contribution</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">contribution</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">title</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Title</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">mainTitle</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Weapons of math destruction</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">mainTitle</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Title</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">title</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">content</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/contentTypes/txt"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#ComplexSubject"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdfs</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">label</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">rdfs</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Big data--Social aspects--United States</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">rdfs</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">label</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">authoritativeLabel</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Big data--Social aspects--United States</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">authoritativeLabel</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">isMemberOfMADSScheme</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">componentList</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">parseType</span>=<span style="color: #2aa198;">"Collection"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh2012003227"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh00002758"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Geographic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/rwo/agents/n78095330-781"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">componentList</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bflc</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">bigdatasocialaspectsunitedstates</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">source</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#ComplexSubject"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdfs</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">label</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">rdfs</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Big data--Political aspects--United States</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">rdfs</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">label</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">authoritativeLabel</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Big data--Political aspects--United States</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">authoritativeLabel</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">isMemberOfMADSScheme</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">componentList</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">parseType</span>=<span style="color: #2aa198;">"Collection"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh2012003227"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh00005651"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Geographic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/rwo/agents/n78095330-781"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">componentList</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bflc</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">bigdatapoliticalaspectsunitedstates</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">source</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#ComplexSubject"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdfs</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">label</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">rdfs</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Social indicators--Mathematical models--Moral and ethical aspects</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">rdfs</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">label</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">authoritativeLabel</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Social indicators--Mathematical models--Moral and ethical aspects</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">authoritativeLabel</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">isMemberOfMADSScheme</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">componentList</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">parseType</span>=<span style="color: #2aa198;">"Collection"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">madsrdf</span>=<span style="color: #2aa198;">"http://www.loc.gov/mads/rdf/v1#"</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh85123962"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh2002007921"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">about</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh00006099"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">madsrdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">componentList</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bflc</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">socialindicatorsmathematicalmodelsmoralandethicalaspects</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">aap-normalized</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">source</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Topic</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh2008102152"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">subject</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/authorities/subjects/sh2009100039"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">dcterms</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">isPartOf</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/resources/works"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">dcterms</span>=<span style="color: #2aa198;">"http://purl.org/dc/terms/"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">relation</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Relation</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">relationship</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/relationship/otherphysicalformat"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">relationship</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/entities/relationships/onlineversion"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">associatedResource</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/resources/works/19044863"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Relation</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">relation</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">hasInstance</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/resources/instances/19016283"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">status</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/mstatus/n"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">date</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">datatype</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema#date"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">2016-03-15</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">date</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">agent</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/organizations/dlc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">status</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/mstatus/c"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">date</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">datatype</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema#dateTime"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">2019-05-16T11:05:36</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">date</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">descriptionModifier</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/organizations/dlc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">status</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/mstatus/c"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">agent</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/organizations/dlcmrc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">generationProcess</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"https://github.com/lcnetdev/marc2bibframe2/releases/tag/v2.7.0"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">date</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">datatype</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema#dateTime"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">2024-08-03T15:19:09.987793-04:00</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">date</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">descriptionLevel</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bibframe-2-3-0/"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bflc</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">encodingLevel</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/menclvl/f"</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">bflc</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/bflc/"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">descriptionConventions</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/descriptionConventions/isbd"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">identifiedBy</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Local</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">value</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">19016283</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">value</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">assigner</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/organizations/dlc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Local</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">identifiedBy</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">lclocal</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">d906</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">lclocal</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/lclocal/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">=906     $a 7 $b cbc $c orignew $d 1 $e ecip $f 20 $g y-gencatlg</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">lclocal</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">d906</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">lclocal</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">d925</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">lclocal</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/lclocal/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">=925  0  $a Acquire $b 1 shelf copy $x Sel/ddw, 2016-09-26</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">lclocal</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">d925</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">lclocal</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">d955</span> <span style="color: #268bd2;">xmlns</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">lclocal</span>=<span style="color: #2aa198;">"http://id.loc.gov/ontologies/lclocal/"</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">=955     $b rk14 2016-03-15 $c rk14 2016-03-15 telework to subj $d re23 2016-04-04 (telework) to Dewey $w xm09 2016-04-05 $a xn05 2016-09-21 1 copy rec'd., to CIP ver. $f rk05 2016-10-07 to CALM (telework)  x-copy/discard to CALM $a hh12 2019-04-12 Copy On Order for Loan $a hh12 2019-05-16 Book picked up by C. Townsend, 4/22/2019</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">lclocal</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">d955</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">descriptionLanguage</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/languages/eng"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">descriptionConventions</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/descriptionConventions/rda"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">descriptionAuthentication</span> <span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #6c71c4;">resource</span>=<span style="color: #2aa198;">"http://id.loc.gov/vocabulary/marcauthen/pcc"</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">AdminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">adminMetadata</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">bf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">Work</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
<span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">rdf</span><span style="color: #839496; background-color: #002b36;">:</span><span style="color: #268bd2;">RDF</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
</pre>
</div>
</div>
</div>
