bfloc2alma.org
** Creating BIBFRAME work and instance in Alma
Before posting something to Alma, we initiate a session. With that, all requests to the Alma API can share the same parameters (API-Key etc.). It's much faster for multiple calls, too. The headers are the same as in the config above. We could have taken the =ALMA_API_HEADERS=, but I repeat them here so we can see them.

#+name: session
#+begin_src python :session python
# session for API calls to Alma
session_alma = requests.Session()
session_alma.headers.update({
    "accept": "application/xml",
    "content-type": "application/xml",
    "validate": "false",
    "authorization": f"apikey {API_KEY}"
})
#+end_src

Now we prepare the payload and post it to Alma:
#+name: prep-post
#+begin_src python :session python
prepd_work = prep_rec(work_xml)
work_post_resp = session_alma.post(bib_api.format(mms_id=""), data=prepd_work)
#+end_src

Let's look at the result:
#+begin_src python :session python
work_post_resp.text
#+end_src

#+name: alma-post-res
#+begin_src xml
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<bib>
  <mms_id>97148831599003331</mms_id>
  <record_format>lc_bf_work</record_format>
  <linked_record_id/>
  <title>Weapons of math destruction</title>
  <author>O'Neil, Cathy</author>
  <holdings link="https://api-eu.hosted.exlibrisgroup.com/almaws/v1/bibs/97148831599003331/holdings"/>
  <created_by>API, development_PSB-OBV_rw</created_by>
  <created_date>2025-03-27Z</created_date>
  <last_modified_by>API, development_PSB-OBV_rw</last_modified_by>
  <last_modified_date>2025-03-27Z</last_modified_date>
  <suppress_from_publishing>true</suppress_from_publishing>
  <suppress_from_external_search>false</suppress_from_external_search>
  <suppress_from_metadoor>false</suppress_from_metadoor>
  <sync_with_oclc>NONE</sync_with_oclc>
  <sync_with_libraries_australia>NONE</sync_with_libraries_australia>
  <originating_system>43ACC_NETWORK</originating_system>
  <originating_system_id>19016283</originating_system_id>
  <brief_level desc="10">10</brief_level>
  <record>
    <rdf:RDF xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#">
      <bf:Work xmlns:bf="http://id.loc.gov/ontologies/bibframe/" rdf:about="http://id.loc.gov/resources/works/19016283">
        <bflc:aap xmlns:bflc="http://id.loc.gov/ontologies/bflc/">O'Neil, Cathy Weapons of math destruction</bflc:aap>
        <bflc:aap-normalized xmlns:bflc="http://id.loc.gov/ontologies/bflc/">o'neilcathyweaponsofmathdestruction</bflc:aap-normalized>
        <rdf:type rdf:resource="http://id.loc.gov/ontologies/bibframe/Text"/>
        <rdf:type rdf:resource="http://id.loc.gov/ontologies/bibframe/Monograph"/>
        <bf:language rdf:resource="http://id.loc.gov/vocabulary/languages/eng"/>
        <bf:supplementaryContent rdf:resource="http://id.loc.gov/vocabulary/msupplcont/bibliography"/>
        <bf:supplementaryContent rdf:resource="http://id.loc.gov/vocabulary/msupplcont/index"/>
        <bf:geographicCoverage rdf:resource="http://id.loc.gov/vocabulary/geographicAreas/n-us"/>
        <bf:classification>
          <bf:ClassificationLcc>
            <bf:classificationPortion>QA76.9.B45</bf:classificationPortion>
            <bf:itemPortion>O64 2016</bf:itemPortion>
            <bf:assigner rdf:resource="http://id.loc.gov/vocabulary/organizations/dlc"/>
            <bf:status rdf:resource="http://id.loc.gov/vocabulary/mstatus/uba"/>
          </bf:ClassificationLcc>
        </bf:classification>
        <bf:classification>
          <bf:ClassificationDdc>
            <bf:classificationPortion>005.7</bf:classificationPortion>
            <bf:source>
              <bf:Source>
                <bf:code>23</bf:code>
              </bf:Source>
            </bf:source>
            <bf:edition>full</bf:edition>
            <bf:assigner rdf:resource="http://id.loc.gov/vocabulary/organizations/dlc"/>
          </bf:ClassificationDdc>
        </bf:classification>
        <bf:contribution>
          <bf:Contribution>
            <rdf:type rdf:resource="http://id.loc.gov/ontologies/bibframe/PrimaryContribution"/>
            <bf:agent rdf:resource="http://id.loc.gov/rwo/agents/no2013123474"/>
            <bf:role rdf:resource="http://id.loc.gov/vocabulary/relators/aut"/>
          </bf:Contribution>
        </bf:contribution>
        <bf:title>
          <bf:Title>
            <bf:mainTitle>Weapons of math destruction</bf:mainTitle>
          </bf:Title>
        </bf:title>
        <bf:content rdf:resource="http://id.loc.gov/vocabulary/contentTypes/txt"/>
        <bf:subject>
          <bf:Topic>
            <rdf:type rdf:resource="http://www.loc.gov/mads/rdf/v1#ComplexSubject"/>
            <rdfs:label xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#">Big data--Social aspects--United States</rdfs:label>
            <madsrdf:authoritativeLabel xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#">Big data--Social aspects--United States</madsrdf:authoritativeLabel>
            <madsrdf:isMemberOfMADSScheme xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#" rdf:resource="http://id.loc.gov/authorities/subjects"/>
            <madsrdf:componentList xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#" rdf:parseType="Collection">
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh2012003227"/>
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh00002758"/>
              <madsrdf:Geographic rdf:about="http://id.loc.gov/rwo/agents/n78095330-781"/>
            </madsrdf:componentList>
            <bflc:aap-normalized xmlns:bflc="http://id.loc.gov/ontologies/bflc/">bigdatasocialaspectsunitedstates</bflc:aap-normalized>
            <bf:source rdf:resource="http://id.loc.gov/authorities/subjects"/>
          </bf:Topic>
        </bf:subject>
        <bf:subject>
          <bf:Topic>
            <rdf:type rdf:resource="http://www.loc.gov/mads/rdf/v1#ComplexSubject"/>
            <rdfs:label xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#">Big data--Political aspects--United States</rdfs:label>
            <madsrdf:authoritativeLabel xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#">Big data--Political aspects--United States</madsrdf:authoritativeLabel>
            <madsrdf:isMemberOfMADSScheme xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#" rdf:resource="http://id.loc.gov/authorities/subjects"/>
            <madsrdf:componentList xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#" rdf:parseType="Collection">
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh2012003227"/>
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh00005651"/>
              <madsrdf:Geographic rdf:about="http://id.loc.gov/rwo/agents/n78095330-781"/>
            </madsrdf:componentList>
            <bflc:aap-normalized xmlns:bflc="http://id.loc.gov/ontologies/bflc/">bigdatapoliticalaspectsunitedstates</bflc:aap-normalized>
            <bf:source rdf:resource="http://id.loc.gov/authorities/subjects"/>
          </bf:Topic>
        </bf:subject>
        <bf:subject>
          <bf:Topic>
            <rdf:type rdf:resource="http://www.loc.gov/mads/rdf/v1#ComplexSubject"/>
            <rdfs:label xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#">Social indicators--Mathematical models--Moral and ethical aspects</rdfs:label>
            <madsrdf:authoritativeLabel xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#">Social indicators--Mathematical models--Moral and ethical aspects</madsrdf:authoritativeLabel>
            <madsrdf:isMemberOfMADSScheme xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#" rdf:resource="http://id.loc.gov/authorities/subjects"/>
            <madsrdf:componentList xmlns:madsrdf="http://www.loc.gov/mads/rdf/v1#" rdf:parseType="Collection">
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh85123962"/>
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh2002007921"/>
              <madsrdf:Topic rdf:about="http://id.loc.gov/authorities/subjects/sh00006099"/>
            </madsrdf:componentList>
            <bflc:aap-normalized xmlns:bflc="http://id.loc.gov/ontologies/bflc/">socialindicatorsmathematicalmodelsmoralandethicalaspects</bflc:aap-normalized>
            <bf:source rdf:resource="http://id.loc.gov/authorities/subjects"/>
          </bf:Topic>
        </bf:subject>
        <bf:subject rdf:resource="http://id.loc.gov/authorities/subjects/sh2008102152"/>
        <bf:subject rdf:resource="http://id.loc.gov/authorities/subjects/sh2009100039"/>
        <dcterms:isPartOf xmlns:dcterms="http://purl.org/dc/terms/" rdf:resource="http://id.loc.gov/resources/works"/>
        <bf:relation>
          <bf:Relation>
            <bf:relationship rdf:resource="http://id.loc.gov/vocabulary/relationship/otherphysicalformat"/>
            <bf:relationship rdf:resource="http://id.loc.gov/entities/relationships/onlineversion"/>
            <bf:associatedResource rdf:resource="http://id.loc.gov/resources/works/19044863"/>
          </bf:Relation>
        </bf:relation>
        <bf:hasInstance rdf:resource="http://id.loc.gov/resources/instances/19016283"/>
        <bf:adminMetadata>
          <bf:AdminMetadata>
            <bf:status rdf:resource="http://id.loc.gov/vocabulary/mstatus/n"/>
            <bf:date rdf:datatype="http://www.w3.org/2001/XMLSchema#date">2016-03-15</bf:date>
            <bf:agent rdf:resource="http://id.loc.gov/vocabulary/organizations/dlc"/>
          </bf:AdminMetadata>
        </bf:adminMetadata>
        <bf:adminMetadata>
          <bf:AdminMetadata>
            <bf:status rdf:resource="http://id.loc.gov/vocabulary/mstatus/c"/>
            <bf:date rdf:datatype="http://www.w3.org/2001/XMLSchema#dateTime">2019-05-16T11:05:36</bf:date>
            <bf:descriptionModifier rdf:resource="http://id.loc.gov/vocabulary/organizations/dlc"/>
          </bf:AdminMetadata>
        </bf:adminMetadata>
        <bf:adminMetadata>
          <bf:AdminMetadata>
            <bf:status rdf:resource="http://id.loc.gov/vocabulary/mstatus/c"/>
            <bf:agent rdf:resource="http://id.loc.gov/vocabulary/organizations/dlcmrc"/>
            <bf:generationProcess rdf:resource="https://github.com/lcnetdev/marc2bibframe2/releases/tag/v2.7.0"/>
            <bf:date rdf:datatype="http://www.w3.org/2001/XMLSchema#dateTime">2024-08-03T15:19:09.987793-04:00</bf:date>
          </bf:AdminMetadata>
        </bf:adminMetadata>
        <bf:adminMetadata>
          <bf:AdminMetadata>
            <bf:descriptionLevel rdf:resource="http://id.loc.gov/ontologies/bibframe-2-3-0/"/>
            <bflc:encodingLevel xmlns:bflc="http://id.loc.gov/ontologies/bflc/" rdf:resource="http://id.loc.gov/vocabulary/menclvl/f"/>
            <bf:descriptionConventions rdf:resource="http://id.loc.gov/vocabulary/descriptionConventions/isbd"/>
            <bf:identifiedBy>
              <bf:Local>
                <rdf:value>19016283</rdf:value>
                <bf:assigner rdf:resource="http://id.loc.gov/vocabulary/organizations/dlc"/>
              </bf:Local>
            </bf:identifiedBy>
            <lclocal:d906 xmlns:lclocal="http://id.loc.gov/ontologies/lclocal/">=906     $a 7 $b cbc $c orignew $d 1 $e ecip $f 20 $g y-gencatlg</lclocal:d906>
            <lclocal:d925 xmlns:lclocal="http://id.loc.gov/ontologies/lclocal/">=925  0  $a Acquire $b 1 shelf copy $x Sel/ddw, 2016-09-26</lclocal:d925>
            <lclocal:d955 xmlns:lclocal="http://id.loc.gov/ontologies/lclocal/">=955     $b rk14 2016-03-15 $c rk14 2016-03-15 telework to subj $d re23 2016-04-04 (telework) to Dewey $w xm09 2016-04-05 $a xn05 2016-09-21 1 copy rec'd., to CIP ver. $f rk05 2016-10-07 to CALM (telework)  x-copy/discard to CALM $a hh12 2019-04-12 Copy On Order for Loan $a hh12 2019-05-16 Book picked up by C. Townsend, 4/22/2019</lclocal:d955>
            <bf:descriptionLanguage rdf:resource="http://id.loc.gov/vocabulary/languages/eng"/>
            <bf:descriptionConventions rdf:resource="http://id.loc.gov/vocabulary/descriptionConventions/rda"/>
            <bf:descriptionAuthentication rdf:resource="http://id.loc.gov/vocabulary/marcauthen/pcc"/>
          </bf:AdminMetadata>
        </bf:adminMetadata>
        <bf:sameAs rdf:about="https://eu02.alma.exlibrisgroup.com/bf/works/97148831599003331?env=sandbox"/>
        <bf:adminMetadata>
          <bf:AdminMetadata>
            <bf:identifiedBy>
              <bf:Local>
                <rdf:value>97148831599003331</rdf:value>
              </bf:Local>
              <bf:source>ALMA</bf:source>
            </bf:identifiedBy>
          </bf:AdminMetadata>
        </bf:adminMetadata>
      </bf:Work>
    </rdf:RDF>
  </record>
</bib>
#+end_src

