bfloc2alma.org
** Parsing the responses from Alma for further processing
That worked! Maybe we want to do something with the Data. To be able to do that, we parse the response into an XML tree, so we can get information (for example the MMS-ID) out of it or manipulate the data.
#+begin_src python :session python :exports both
work_tree = ET.fromstring(work_post_resp.text)
work_mms = work_tree.find('mms_id')

work_mms.text
#+end_src

#+RESULTS:
: 97148830299403331

Note that, while not obvious in this case, the argument to =find= is an XPath-expression.

Now, let's do that with the instance:
#+begin_src python :session python :exports both
instance_post_resp = session_alma.post(bib_api.format(mms_id=""), data=prep_rec(instance_xml))
instance_mms = ET.fromstring(instance_post_resp.text).find('mms_id')

instance_mms.text
#+end_src

#+RESULTS:
: 99148830299303331
** Update
To update a record, we take the API response from earlier and make a change to it. We already have it as an =ElementTree= in the variable =work_tree=. For simplicity's sake, we just change the text of an existing element:

#+begin_src python :session python
# change the title
work_tree.find('record//bf:title/bf:Title/bf:mainTitle', NS).text = "!!! *** CHANGED TITLE *** !!!"
#+end_src

The stars and exclamation marks are for better visibility, so I can spot it in the wall of text of XML output without line breaks.🔍🤓

Interestingly, Alma can't digest it's own output. Do you remember the =<record_format>lcbf_work</record_format>= in the wrapper around our BIBFRAME? If you go back and take a close look, you will see, that the text in Alma's response is a bit different: =lc_bf_format=. I don't know why this is, but if you put it into Alma, the record format is not recognized. There's no error, Alma just saves an empty record. We don't want that, so we have to fill in the correct text again:

#+begin_src python :session python
work_tree.find("record_format").text = "lcbf_work"
#+end_src

*This will be fixed in the July 2025 release of Alma!* Ex Libris has found the bug and will fix it.

To get the changed record back into Alma, we need to make a PUT request with the changed record as payload:
#+begin_src python :session python
changed_work_put_resp = session_alma.put(bib_api.format(mms_id=work_mms.text),
                                         data=ET.tostring(work_tree))
#+end_src

** Deleting the records again
Now, let's delete the records, so we don't have to look for new examples every time this runs.

Note that when one tries to delete the work before the instance, this will fail:
#+begin_src python :session python
work_del_res = session_alma.delete(bib_api.format(mms_id=work_mms.text))
work_del_res.text
#+end_src

#+begin_src xml
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<web_service_result xmlns="http://com/exlibris/urm/general/xmlbeans">
  <errorsExist>true</errorsExist>
  <errorList>
    <error>
      <errorCode>10109</errorCode>
      <errorMessage>Work associated with an instance cannot be deleted.</errorMessage>
      <trackingId>E01-1102165359-2MLXS-AWAE273450733</trackingId>
    </error>
  </errorList>
</web_service_result>
#+end_src

So we delete the instance first:
#+begin_src python :session python :exports both
instance_del_res = session_alma.delete(bib_api.format(mms_id=instance_mms.text))
instance_del_res.status_code
#+end_src

#+RESULTS:
: 204

As expected, Alma returns =HTTP 204=, now for the work.
#+begin_src python :session python :exports both
work_del_res = session_alma.delete(bib_api.format(mms_id=work_mms.text))
work_del_res.status_code
#+end_src

#+RESULTS:
: 204

All good!
* Simple CLI for importing multiple records
Here is a simple script which allows one to specify multiple identifiers on the command line to load into Alma. The invocation would be like this:

#+begin_src bash
(.venv)$ python3 bfloc2alma.py 19016283 12983234
#+end_src
** Imports
We import the usual suspects and our configuration and library code. It is assumed that your API key is stored in an environment variable =API_KEY_PSB=. The =argparse= library is used to create a simple command line interface.

#+begin_src python :tangle bfloc2alma/bfloc2alma.py
#!/usr/bin/env python3

import argparse
from sys import exit

import requests

from config import *  # bad practice, import constants separately
from lib import get_bibframe_from_loc, prep_rec, get_mmsid
#+end_src

