docs/index.html
<div id="outline-container-org173cf50" class="outline-3">
<h3 id="org173cf50"><span class="section-number-3">4.3.</span> Parsing the responses from Alma for further processing</h3>
<div class="outline-text-3" id="text-4-3">
<p>
That worked! Maybe we want to do something with the Data. To be able to do that, we parse the response into an XML tree, so we can get information (for example the MMS-ID) out of it or manipulate the data.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">work_tree</span> = ET.fromstring(work_post_resp.text)
<span style="color: #6c71c4;">work_mms</span> = work_tree.find(<span style="color: #2aa198;">'mms_id'</span>)

work_mms.text
</pre>
</div>

<p>
Note that, while not obvious in this case, the argument to <code>find</code> is an XPath-expression.
</p>

<p>
Now, let&rsquo;s do that with the instance:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">instance_post_resp</span> = session_alma.post(bib_api.<span style="color: #268bd2;">format</span>(mms_id=<span style="color: #2aa198;">""</span>), data=prep_rec(instance_xml))
<span style="color: #6c71c4;">instance_mms</span> = ET.fromstring(instance_post_resp.text).find(<span style="color: #2aa198;">'mms_id'</span>)

instance_mms.text
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf659c78" class="outline-3">
<h3 id="orgf659c78"><span class="section-number-3">4.4.</span> Update</h3>
<div class="outline-text-3" id="text-4-4">
<p>
To update a record, we take the API response from earlier and make a change to it. We already have it as an <code>ElementTree</code> in the variable <code>work_tree</code>. For simplicity&rsquo;s sake, we just change the text of an existing element:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #405A61;"># </span><span style="color: #405A61;">change the title</span>
work_tree.find(<span style="color: #2aa198;">'record//bf:title/bf:Title/bf:mainTitle'</span>, <span style="color: #b58900;">NS</span>).<span style="color: #b58900;">text</span> = <span style="color: #2aa198;">"!!! *** CHANGED TITLE *** !!!"</span>
</pre>
</div>

<p>
The stars and exclamation marks are for better visibility, so I can spot it in the wall of text of XML output without line breaks.
</p>

<p>
Interestingly, Alma can&rsquo;t digest it&rsquo;s own output. Do you remember the <code>&lt;record_format&gt;lcbf_work&lt;/record_format&gt;</code> in the wrapper around our BIBFRAME? If you go back and take a close look, you will see, that the text in Alma&rsquo;s response is a bit different: <code>lc_bf_format</code>. I don&rsquo;t know why this is, but if you put it into Alma, the record format is not recognized. There&rsquo;s no error, Alma just saves an empty record. We don&rsquo;t want that, so we have to fill in the correct text again:
</p>

<div class="org-src-container">
<pre class="src src-python">work_tree.find(<span style="color: #2aa198;">"record_format"</span>).<span style="color: #6c71c4;">text</span> = <span style="color: #2aa198;">"lcbf_work"</span>
</pre>
</div>

<p>
<b>This will be fixed in the July 2025 release of Alma!</b> Ex Libris has found the bug and will fix it.
</p>

<p>
To get the changed record back into Alma, we need to make a PUT request with the changed record as payload:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">changed_work_put_resp</span> = session_alma.put(bib_api.<span style="color: #268bd2;">format</span>(mms_id=work_mms.text),
                                         data=ET.tostring(work_tree))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac6abd1" class="outline-3">
<h3 id="orgac6abd1"><span class="section-number-3">4.5.</span> Deleting the records again</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Now, let&rsquo;s delete the records, so we don&rsquo;t have to look for new examples every time this runs.
</p>

<p>
Note that when one tries to delete the work before the instance, this will fail:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">work_del_res</span> = session_alma.delete(bib_api.<span style="color: #268bd2;">format</span>(mms_id=work_mms.text))
work_del_res.text
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #839496; background-color: #002b36;">&lt;?</span><span style="color: #859900; font-weight: bold;">xml</span> <span style="color: #35a69c;">version="1.0" encoding="utf-8"</span><span style="color: #839496; background-color: #002b36;">?&gt;</span>
<span style="color: #839496; background-color: #002b36;">&lt;?</span><span style="color: #859900; font-weight: bold;">xml</span> <span style="color: #35a69c;">version="1.0" encoding="UTF-8" standalone="yes"</span><span style="color: #839496; background-color: #002b36;">?&gt;</span>
<span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">web_service_result</span> <span style="color: #268bd2;">xmlns</span>=<span style="color: #2aa198;">"http://com/exlibris/urm/general/xmlbeans"</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">errorsExist</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">true</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">errorsExist</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">errorList</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">error</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">errorCode</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">10109</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">errorCode</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">errorMessage</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">Work associated with an instance cannot be deleted.</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">errorMessage</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
      <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #268bd2;">trackingId</span><span style="color: #839496; background-color: #002b36;">&gt;</span><span style="color: #839496; background-color: #002b36;">E01-1102165359-2MLXS-AWAE273450733</span><span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">trackingId</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
    <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">error</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
  <span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">errorList</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
<span style="color: #839496; background-color: #002b36;">&lt;</span><span style="color: #839496; background-color: #002b36;">/</span><span style="color: #268bd2;">web_service_result</span><span style="color: #839496; background-color: #002b36;">&gt;</span>
</pre>
</div>

<p>
So we delete the instance first:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">instance_del_res</span> = session_alma.delete(bib_api.<span style="color: #268bd2;">format</span>(mms_id=instance_mms.text))
instance_del_res.status_code
</pre>
</div>

<p>
As expected, Alma returns <code>HTTP 204</code>, now for the work.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">work_del_res</span> = session_alma.delete(bib_api.<span style="color: #268bd2;">format</span>(mms_id=work_mms.text))
work_del_res.status_code
</pre>
</div>

<p>
All good!
</p>
</div>
</div>
</div>
<div id="outline-container-org816bad1" class="outline-2">
<h2 id="org816bad1"><span class="section-number-2">5.</span> Simple CLI for importing multiple records</h2>
<div class="outline-text-2" id="text-5">
<p>
Here is a simple script which allows one to specify multiple identifiers on the command line to load into Alma. The invocation would be like this:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #268bd2;">(</span>.venv<span style="color: #268bd2;">)</span>$ python3 bfloc2alma.py <span style="color: #d33682; font-weight: bold;">19016283</span> <span style="color: #d33682; font-weight: bold;">12983234</span>
</pre>
</div>
</div>
<div id="outline-container-org2fea2f2" class="outline-3">
<h3 id="org2fea2f2"><span class="section-number-3">5.1.</span> Imports</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We import the usual suspects and our configuration and library code. It is assumed that your API key is stored in an environment variable <code>API_KEY_PSB</code>. The <code>argparse</code> library is used to create a simple command line interface.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #405A61;">#</span><span style="color: #405A61;">!/usr/bin/env python3</span>

<span style="color: #859900; font-weight: bold;">import</span> argparse
<span style="color: #859900; font-weight: bold;">from</span> sys <span style="color: #859900; font-weight: bold;">import</span> <span style="color: #d33682; font-weight: bold;">exit</span>

<span style="color: #859900; font-weight: bold;">import</span> requests

<span style="color: #859900; font-weight: bold;">from</span> config <span style="color: #859900; font-weight: bold;">import</span> *  <span style="color: #405A61;"># </span><span style="color: #405A61;">bad practice, import constants separately</span>
<span style="color: #859900; font-weight: bold;">from</span> lib <span style="color: #859900; font-weight: bold;">import</span> get_bibframe_from_loc, prep_rec, get_mmsid
</pre>
</div>
</div>
</div>
