bfloc2alma.org
** Argument parsing
We want to be able to give the IDs on the command line, so we use =argparse= to make a CLI.
#+begin_src python :tangle bfloc2alma/bfloc2alma.py
parser = argparse.ArgumentParser()
parser.add_argument("loc_ids",
                    nargs="+",
                    help="The LoC-IDs to be imported into Alma")
parser.add_argument("-c",
                    "--cleanup",
                    help="Delete created records afterwards",
                    action="store_true")

args = parser.parse_args()
#+end_src

This is not only useful to get command line arguments, but gives us a nice help message too:

#+begin_src shell :tangle no
$ ./bfloc2alma.py -h

usage: bfloc2alma.py [-h] [-c] loc_ids [loc_ids ...]

positional arguments:
  loc_ids        The LoC-IDs to be imported into Alma

options:
  -h, --help     show this help message and exit
  -c, --cleanup  Delete created records afterwards

#+end_src

** Getting data from LoC
Then we set up the session for posting to Alma:

#+begin_src python :tangle bfloc2alma/bfloc2alma.py

session = requests.Session()
session.headers.update(ALMA_SESSION_HEADERS)

#+end_src

We could set up another session for getting the records from LoC and pass it to =get_bibframe_from_loc=, but it's not necessary.

Now, we are ready to get BIBFRAME from the LoC. To keep it simple, we put works and instances in the same list. =get_bibframe_from_loc()= returns the XML-String of the BIBFRAME work or instance. So, =loc_bf= will be a list of strings in the end.
#+begin_src python :tangle bfloc2alma/bfloc2alma.py
# get the records from loc
loc_bf = []
for loc_id in args.loc_ids:
    print(f"Getting bf work from loc: {loc_id}")
    bf_work = get_bibframe_from_loc(loc_id, "work")
    loc_bf.append(bf_work)
    print(f"Getting bf instance from loc: {loc_id}")
    bf_instance = get_bibframe_from_loc(loc_id, "instance")
    loc_bf.append(bf_instance)

#+end_src

** Importing into Alma
Before beginning to put things into Alma, we initialize a list in which to put the MMS-IDs of the records. We will use this list to clean up afterwards, so we can use the same records multiple times for testing purposes.

#+begin_src python :tangle bfloc2alma/bfloc2alma.py
# lists for the MMS-IDs for later use
mmsids = []

#+end_src

To post the BIBFRAME works and instances to Alma, we iterate over the list of XML-strings we got earlier.

#+begin_src python :tangle bfloc2alma/bfloc2alma.py
## prepare the XML and import it into alma

for bf in loc_bf:
    post_res = session.post(bib_api.format(mms_id=""),
                 prep_rec(bf))

    # blow up if HTTP error
    try:
        post_res.raise_for_status()
    except Exception as error:
        print(post_res.text)
        continue

    mms = get_mmsid(post_res)
    mmsids.append(mms)
    entity = "work" if mms.startswith("97") else "instance"
    print(f"Imported {entity}: {mms}")

#+end_src


** Cleanup after test runs
For test runs, we want to delete the records again. This is controlled by the =--cleanup= flag on the command line. Work cannot be deleted if they have instances, so we need to reverse the list of MMS-IDs before iterating oder it.

#+begin_src python :tangle bfloc2alma/bfloc2alma.py
if args.cleanup:
    # iterate over reversed list, so to delete the instances first
    mmsids.reverse()
    for mmsid in mmsids:
        print(f"deleting {mmsid}")
        del_res = session.delete(bib_api.format(mms_id=mmsid))
        print(f"   {del_res.status_code}")
#+end_src
** Example execution
You can run the script with =python3 bfloc2alma.py 19016283 12983234 --cleanup=. As we have added a shebang line, you can make the file executable on MacOS or Linux:

#+begin_src bash :exports code
$ chmod +x bfloc2alma.py
#+end_src

After that you can run it like this:

#+begin_src bash :exports code
./bfloc2alma.py 19016283 12983234 -c
Getting bf work from loc: 19016283
Getting bf instance from loc: 19016283
Getting bf work from loc: 12983234
Getting bf instance from loc: 12983234
Imported work: 97148831596703331
Imported instance: 99148831596603331
Imported work: 97148831596503331
Imported instance: 99148831596403331
deleting 99148831596403331
   204
deleting 97148831596503331
   204
deleting 99148831596603331
   204
deleting 97148831596703331
   204

#+end_src
* Import BIBFRAME from LoC into Alma :noexport:
:PROPERTIES:
:EXPORT_FILE_NAME: docs/slides
:OPTIONS: H:2
:END:
** Preparations
*** Python and dependencies
#+begin_src python :noweb yes
<<shell-venv>>
#+end_src

#+begin_src python :noweb yes
<<shell-pip>>
#+end_src
*** API key
#+begin_src python :noweb yes
<<shell-api-key>>
#+end_src
** Configuration
*** Imports
#+begin_src python
import os
from xml.etree import ElementTree as ET
#+end_src
*** Namespaces
#+BEGIN_SRC python :noweb yes
<<namespaces>>
#+END_SRC
*** API key
#+begin_src python :noweb yes
<<api-key>>
#+end_src
*** URL for the BIB API
#+begin_src python :noweb yes
<<api-base-url>>
#+end_src
*** Headers for session
#+begin_src python :noweb yes
<<alma-session-headers>>
#+end_src
** Functions
*** Getting data from LoC
#+begin_src python -n :noweb yes
<<get-bibframe-from-loc>>
#+end_src
*** Prepare BIBFRAME to be imported
#+begin_src python -n :noweb yes
<<prep-rec>>
#+end_src
*** Getting the MMS ID from an API response
#+begin_src python :noweb yes
<<get-mmsid>>
#+end_src
** Example
*** Get data from Library of Congress
#+begin_src python :noweb yes
work_xml = get_bibframe_from_loc("19016283", entity="work", compact=True)

print(work_xml)
#+end_src

The result:
#+begin_src xml :noweb yes
<<loc-bf>>
#+end_src
*** Creating BIBFRAME work in Alma
**** Initializing a session
#+begin_src python :noweb yes
<<session>>
#+end_src

#+RESULTS:
**** Preparing and POSTing the BIBFRAME to Alma
#+begin_src python :noweb yes
<<prep-post>>
#+end_src
*** Looking at the result
#+begin_src python
work_post_resp.text
#+end_src

#+begin_src xml :noweb yes
<<alma-post-res>>
#+end_src
*** Further processing
Reading the response into an XML-Tree:
#+begin_src python
work_tree = ET.fromstring(work_post_resp.text)
work_mms = get_mmsid(work_post_resp)

work_mms
#+end_src

#+begin_src
97148831595303331
#+end_src
