docs/index.html
<div id="outline-container-org0bf1d97" class="outline-3">
<h3 id="org0bf1d97"><span class="section-number-3">5.2.</span> Argument parsing</h3>
<div class="outline-text-3" id="text-5-2">
<p>
We want to be able to give the IDs on the command line, so we use <code>argparse</code> to make a CLI.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">parser</span> = argparse.ArgumentParser()
parser.add_argument(<span style="color: #2aa198;">"loc_ids"</span>,
                    nargs=<span style="color: #2aa198;">"+"</span>,
                    <span style="color: #268bd2;">help</span>=<span style="color: #2aa198;">"The LoC-IDs to be imported into Alma"</span>)
parser.add_argument(<span style="color: #2aa198;">"-c"</span>,
                    <span style="color: #2aa198;">"--cleanup"</span>,
                    <span style="color: #268bd2;">help</span>=<span style="color: #2aa198;">"Delete created records afterwards"</span>,
                    action=<span style="color: #2aa198;">"store_true"</span>)

<span style="color: #6c71c4;">args</span> = parser.parse_args()
</pre>
</div>

<p>
This is not only useful to get command line arguments, but gives us a nice help message too:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ ./bfloc2alma.py -h

usage: bfloc2alma.py <span style="color: #268bd2;">[</span>-h<span style="color: #268bd2;">]</span> <span style="color: #268bd2;">[</span>-c<span style="color: #268bd2;">]</span> loc_ids <span style="color: #268bd2;">[</span>loc_ids ...<span style="color: #268bd2;">]</span>

positional arguments:
  loc_ids        The LoC-IDs to be imported into Alma

options:
  -h, --help     show this help message and exit
  -c, --cleanup  Delete created records afterwards

</pre>
</div>
</div>
</div>
<div id="outline-container-org09ed118" class="outline-3">
<h3 id="org09ed118"><span class="section-number-3">5.3.</span> Getting data from LoC</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Then we set up the session for posting to Alma:
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #6c71c4;">session</span> = requests.Session()
session.headers.update(ALMA_SESSION_HEADERS)

</pre>
</div>

<p>
We could set up another session for getting the records from LoC and pass it to <code>get_bibframe_from_loc</code>, but it&rsquo;s not necessary.
</p>

<p>
Now, we are ready to get BIBFRAME from the LoC. To keep it simple, we put works and instances in the same list. <code>get_bibframe_from_loc()</code> returns the XML-String of the BIBFRAME work or instance. So, <code>loc_bf</code> will be a list of strings in the end.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #405A61;"># </span><span style="color: #405A61;">get the records from loc</span>
<span style="color: #6c71c4;">loc_bf</span> = []
<span style="color: #859900; font-weight: bold;">for</span> loc_id <span style="color: #859900; font-weight: bold;">in</span> args.loc_ids:
    <span style="color: #268bd2;">print</span>(f<span style="color: #2aa198;">"Getting bf work from loc: </span>{loc_id}<span style="color: #2aa198;">"</span>)
    <span style="color: #6c71c4;">bf_work</span> = get_bibframe_from_loc(loc_id, <span style="color: #2aa198;">"work"</span>)
    loc_bf.append(bf_work)
    <span style="color: #268bd2;">print</span>(f<span style="color: #2aa198;">"Getting bf instance from loc: </span>{loc_id}<span style="color: #2aa198;">"</span>)
    <span style="color: #6c71c4;">bf_instance</span> = get_bibframe_from_loc(loc_id, <span style="color: #2aa198;">"instance"</span>)
    loc_bf.append(bf_instance)

</pre>
</div>
</div>
</div>
<div id="outline-container-org3ba71ae" class="outline-3">
<h3 id="org3ba71ae"><span class="section-number-3">5.4.</span> Importing into Alma</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Before beginning to put things into Alma, we initialize a list in which to put the MMS-IDs of the records. We will use this list to clean up afterwards, so we can use the same records multiple times for testing purposes.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #405A61;"># </span><span style="color: #405A61;">lists for the MMS-IDs for later use</span>
<span style="color: #6c71c4;">mmsids</span> = []

</pre>
</div>

<p>
To post the BIBFRAME works and instances to Alma, we iterate over the list of XML-strings we got earlier.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #405A61;">## </span><span style="color: #405A61;">prepare the XML and import it into alma</span>

<span style="color: #859900; font-weight: bold;">for</span> bf <span style="color: #859900; font-weight: bold;">in</span> loc_bf:
    <span style="color: #6c71c4;">post_res</span> = session.post(bib_api.<span style="color: #268bd2;">format</span>(mms_id=<span style="color: #2aa198;">""</span>),
                 prep_rec(bf))

    <span style="color: #405A61;"># </span><span style="color: #405A61;">blow up if HTTP error</span>
    <span style="color: #859900; font-weight: bold;">try</span>:
        post_res.raise_for_status()
    <span style="color: #859900; font-weight: bold;">except</span> <span style="color: #b58900;">Exception</span> <span style="color: #859900; font-weight: bold;">as</span> error:
        <span style="color: #268bd2;">print</span>(post_res.text)
        <span style="color: #859900; font-weight: bold;">continue</span>

    <span style="color: #6c71c4;">mms</span> = get_mmsid(post_res)
    mmsids.append(mms)
    <span style="color: #6c71c4;">entity</span> = <span style="color: #2aa198;">"work"</span> <span style="color: #859900; font-weight: bold;">if</span> mms.startswith(<span style="color: #2aa198;">"97"</span>) <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #2aa198;">"instance"</span>
    <span style="color: #268bd2;">print</span>(f<span style="color: #2aa198;">"Imported </span>{entity}<span style="color: #2aa198;">: </span>{mms}<span style="color: #2aa198;">"</span>)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc61ee83" class="outline-3">
<h3 id="orgc61ee83"><span class="section-number-3">5.5.</span> Cleanup after test runs</h3>
<div class="outline-text-3" id="text-5-5">
<p>
For test runs, we want to delete the records again. This is controlled by the <code>--cleanup</code> flag on the command line. Work cannot be deleted if they have instances, so we need to reverse the list of MMS-IDs before iterating oder it.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">if</span> args.cleanup:
    <span style="color: #405A61;"># </span><span style="color: #405A61;">iterate over reversed list, so to delete the instances first</span>
    mmsids.reverse()
    <span style="color: #859900; font-weight: bold;">for</span> mmsid <span style="color: #859900; font-weight: bold;">in</span> mmsids:
        <span style="color: #268bd2;">print</span>(f<span style="color: #2aa198;">"deleting </span>{mmsid}<span style="color: #2aa198;">"</span>)
        <span style="color: #6c71c4;">del_res</span> = session.delete(bib_api.<span style="color: #268bd2;">format</span>(mms_id=mmsid))
        <span style="color: #268bd2;">print</span>(f<span style="color: #2aa198;">"   </span>{del_res.status_code}<span style="color: #2aa198;">"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org275f9d9" class="outline-3">
<h3 id="org275f9d9"><span class="section-number-3">5.6.</span> Example execution</h3>
<div class="outline-text-3" id="text-5-6">
<p>
You can run the script with <code>python3 bfloc2alma.py 19016283 12983234 --cleanup</code>. As we have added a shebang line, you can make the file executable on MacOS or Linux:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ <span style="color: #b58900;">chmod</span> +x bfloc2alma.py
</pre>
</div>

<p>
After that you can run it like this:
</p>

<div class="org-src-container">
<pre class="src src-bash">./bfloc2alma.py <span style="color: #d33682; font-weight: bold;">19016283</span> <span style="color: #d33682; font-weight: bold;">12983234</span> -c
Getting bf work from loc: <span style="color: #d33682; font-weight: bold;">19016283</span>
Getting bf instance from loc: <span style="color: #d33682; font-weight: bold;">19016283</span>
Getting bf work from loc: <span style="color: #d33682; font-weight: bold;">12983234</span>
Getting bf instance from loc: <span style="color: #d33682; font-weight: bold;">12983234</span>
Imported work: <span style="color: #d33682; font-weight: bold;">97148831596703331</span>
Imported instance: <span style="color: #d33682; font-weight: bold;">99148831596603331</span>
Imported work: <span style="color: #d33682; font-weight: bold;">97148831596503331</span>
Imported instance: <span style="color: #d33682; font-weight: bold;">99148831596403331</span>
deleting <span style="color: #d33682; font-weight: bold;">99148831596403331</span>
   <span style="color: #d33682; font-weight: bold;">204</span>
deleting <span style="color: #d33682; font-weight: bold;">97148831596503331</span>
   <span style="color: #d33682; font-weight: bold;">204</span>
deleting <span style="color: #d33682; font-weight: bold;">99148831596603331</span>
   <span style="color: #d33682; font-weight: bold;">204</span>
deleting <span style="color: #d33682; font-weight: bold;">97148831596703331</span>
   <span style="color: #d33682; font-weight: bold;">204</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stefan Schuh</p>
<p class="date">Created: 2025-05-19 Mo 07:33</p>
</div>
</body>
</html>
